# { Module 8 Homework }

1. Import the "Dental Patients.xlsx" file and nickname the dataset "df". Preview the first 10 rows. You need to complete this step to have access to the correct dataset!

In [33]:
import pandas as pd
import numpy as np
df = pd.read_excel("Dental Patients.xlsx")
df.head(10)

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
0,Jane,Jackson,35,F,Y,Y,N,48,N
1,Grant,Chaney,62,M,Y,Y,N,15,N
2,Shellie,Fowler,61,F,Y,Y,N,3,N
3,Hortensia,Moore,71,F,Y,Y,N,63,N
4,Gwenda,Oneal,41,F,Y,Y,N,0,N
5,Latricia,Sampson,21,F,Y,Y,N,0,N
6,Eun,Sims,52,M,Y,Y,N,0,N
7,Riva,Andrade,26,M,N,Y,N,0,N
8,Carolyn,Taylor,69,F,N,Y,N,0,N
9,Reid,Sims,37,M,Y,Y,N,341,N

2. Write the code to preview the last 5 rows of the df dataset.

In [2]:
df.tail(5)

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
45,Marjory,Thompson,45,F,N,Y,N,61,N
46,Erlinda,Hendricks,49,F,Y,Y,N,120,N
47,Amee,Carter,57,M,N,Y,N,0,Y
48,Loralee,Gates,66,F,Y,Y,Y,278,Y
49,Luana,Taylor,20,F,N,N,Y,302,N

3. Write the code to print the summary information for the df dataset. How many rows are there? How many columns?

ROWS = 50 COLUMNS = 9

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   First               50 non-null     object
 1   Last                50 non-null     object
 2   Age                 50 non-null     int64
 3   Gender              50 non-null     object
 4   Insurance           50 non-null     object
 5   EmergencyContact    50 non-null     object
 6   NewPatient          50 non-null     object
 7   OutstandingBalance  50 non-null     int64
 8   Allergies           50 non-null     object
dtypes: int64(2), object(7)
memory usage: 3.6+ KB

4. Looking closer at the df dataset, what is the maximum age for this group of patients? What is the minimum age?

MAX AGE = 78 MIN AGE = 19

In [4]:
df["Age"].max()

78

In [5]:
df["Age"].min()

19

5. How much money is owed in total to the dental practice? Hint: find the sum of the "OutstandingBalance" column.

$4,600.00

In [6]:
df["OutstandingBalance"].sum()

4600

6. Write the code below to determine how many new patients there are.

16 new patients

In [22]:
sum(df["NewPatient"] == "Y")

16

7. Write the code below to determine how many patients have any allergies.

9 patients with allergies

In [23]:
sum(df["Allergies"] == "Y")

9

8. Let's select some data based on conditions. Find the data in the df dataset where "Gender" equals "F".

In [24]:
df.loc[df["Gender"] == "F"]

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
0,Jane,Jackson,35,F,Y,Y,N,48,N
2,Shellie,Fowler,61,F,Y,Y,N,3,N
3,Hortensia,Moore,71,F,Y,Y,N,63,N
4,Gwenda,Oneal,41,F,Y,Y,N,0,N
5,Latricia,Sampson,21,F,Y,Y,N,0,N
8,Carolyn,Taylor,69,F,N,Y,N,0,N
10,Jamila,Downs,68,F,Y,N,N,294,N
11,Vannesa,Hays,55,F,Y,Y,N,13,N
13,Lynda,Wilkinson,60,F,Y,Y,N,151,N
14,Gricelda,Andrade,78,F,N,Y,N,128,N
15,Connie,Savage,34,F,N,Y,Y,0,N
16,Erma,Pruitt,36,F,N,Y,N,0,Y
17,Krysten,Richmond,40,F,Y,Y,N,0,N
19,Krystina,Benton,23,F,Y,Y,Y,0,N
20,Sharon,Landry,65,F,N,Y,Y,0,N
21,Marjorie,Dougherty,54,F,Y,Y,Y,0,N
24,Stefany,Mahoney,46,F,Y,N,Y,42,N
26,Juliane,Hayden,24,F,N,N,N,275,N
29,Bernadette,Chan,43,F,Y,N,N,0,N
30,Tessie,Russell,74,F,Y,N,N,152,Y
33,Carolin,Hudson,19,F,Y,Y,Y,49,Y
34,Waneta,Cohen,51,F,Y,Y,N,44,N
36,Joline,Murillo,48,F,Y,Y,Y,41,N
38,Shaquana,Yates,30,F,Y,Y,Y,121,N
39,Margarette,Tapia,70,F,Y,Y,N,235,N
40,Norah,Meyers,44,F,Y,Y,Y,89,N
42,Denita,Taylor,29,F,Y,Y,N,317,N
43,Mathilde,Gaines,32,F,Y,Y,N,0,N
44,Ettie,Wells,73,F,N,Y,N,0,N
45,Marjory,Thompson,45,F,N,Y,N,61,N
46,Erlinda,Hendricks,49,F,Y,Y,N,120,N
48,Loralee,Gates,66,F,Y,Y,Y,278,Y
49,Luana,Taylor,20,F,N,N,Y,302,N

9. Find the data in the df dataset where "OutstandingBalance" equals 0. These are the people who have paid all of their bills!

In [26]:
df.loc[df["OutstandingBalance"] == 0]

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
4,Gwenda,Oneal,41,F,Y,Y,N,0,N
5,Latricia,Sampson,21,F,Y,Y,N,0,N
6,Eun,Sims,52,M,Y,Y,N,0,N
7,Riva,Andrade,26,M,N,Y,N,0,N
8,Carolyn,Taylor,69,F,N,Y,N,0,N
15,Connie,Savage,34,F,N,Y,Y,0,N
16,Erma,Pruitt,36,F,N,Y,N,0,Y
17,Krysten,Richmond,40,F,Y,Y,N,0,N
18,Joel,Santos,39,M,Y,Y,N,0,N
19,Krystina,Benton,23,F,Y,Y,Y,0,N
20,Sharon,Landry,65,F,N,Y,Y,0,N
21,Marjorie,Dougherty,54,F,Y,Y,Y,0,N
29,Bernadette,Chan,43,F,Y,N,N,0,N
43,Mathilde,Gaines,32,F,Y,Y,N,0,N
44,Ettie,Wells,73,F,N,Y,N,0,N
47,Amee,Carter,57,M,N,Y,N,0,Y

10. Complete the code below to find the data in the df dataset where "NewPatient" equals "Y" and "Allergies" also equals "Y".

In [28]:
df.loc[(df["NewPatient"] == "Y") & (df["Allergies"] == "Y")]

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
25,Rosaura,Ellis,33,M,Y,N,Y,10,Y
33,Carolin,Hudson,19,F,Y,Y,Y,49,Y
35,Rana,Parks,27,M,Y,Y,Y,344,Y
48,Loralee,Gates,66,F,Y,Y,Y,278,Y

11. Using the groupby function, group the df dataset by the "Insurance" variable and summarize for the "OutstandingBalance" variable. Use the mean.

In [29]:
df["OutstandingBalance"].groupby(df["Insurance"]).mean()

Insurance
N    85.714286
Y    94.444444
Name: OutstandingBalance, dtype: float64

12. Using the groupby function, group the df dataset by the "Gender" variable and summarize for the "Age" variable. Use the mean.

In [30]:
df["Age"].groupby(df["Gender"]).mean()

Gender
F    47.696970
M    44.529412
Name: Age, dtype: float64

In [34]:
df.crosstab(df["Insurance"], df["Gender"])

AttributeError: 'DataFrame' object has no attribute 'crosstab'

**Why is crosstab not working?  categorical variables? Y